'''পাইথন collection মডিউলটিকে একটি ধারক হিসাবে সংজ্ঞায়িত করা হয় যা ডেটা সংগ্রহের জন্য ব্যবহার করা হয়, উদাহরণস্বরূপ - তালিকা, ডিক্ট, সেট এবং টুপল ইত্যাদি। এটি অন্তর্নির্মিত সংগ্রহের পাত্রের কার্যকারিতা উন্নত করার জন্য চালু করা হয়েছিল।'''

# from collections import abc
import time
import collections
# * nametuple():
'''Python nametuple() ফাংশন টিপলের প্রতিটি অবস্থানের নাম সহ একটি টিপলের মতো বস্তু প্রদান করে। এটি সাধারণ টিপলগুলিতে একটি টিপল বস্তুর প্রতিটি ক্ষেত্রের সূচক মনে রাখার সমস্যা দূর করতে ব্যবহৃত হয়েছিল।'''

pranshu = ('James', 24, 'M')

# *OrderedDict()
'''Python OrderedDict() একটি অভিধান বস্তুর অনুরূপ যেখানে কীগুলি সন্নিবেশের ক্রম বজায় রাখে। যদি আমরা আবার কী সন্নিবেশ করার চেষ্টা করি, তাহলে সেই কীটির জন্য আগের মানটি ওভাররাইট করা হবে।'''

d1 = collections.OrderedDict()
d1['A'] = 10
d1['C'] = 12
d1['B'] = 11
d1['D'] = 13
for k, v in d1.items():
    print(k, v)

# *defaultdict()
'''Python defaultdict() একটি অভিধানের মত বস্তু হিসাবে সংজ্ঞায়িত করা হয়। এটি অন্তর্নির্মিত ডিক্ট ক্লাসের একটি সাবক্লাস। এটি অভিধান দ্বারা প্রদত্ত সমস্ত পদ্ধতি প্রদান করে কিন্তু একটি ডিফল্ট ডেটা টাইপ হিসাবে প্রথম আর্গুমেন্ট নেয়।'''

number = collections.defaultdict(int)
number['one'] = 1
number['two'] = 2
print(number['three'])
# *Counter()
'''পাইথন কাউন্টার হল অভিধান অবজেক্টের একটি সাবক্লাস যা হ্যাশেবল বস্তু গণনা করতে সাহায্য করে।
'''
list = [1, 2, 3, 4, 5, 7, 8, 5, 9, 6, 10]
print(collections.Counter(list))

print(collections.Counter({1: 5, 2: 4}))

list = [1, 2, 4, 7, 5, 1, 6, 7, 6, 9, 1]
print(collections.Counter(list))


# *deque()
'''Python deque() হল একটি ডাবল-এন্ডেড সারি যা আমাদের উভয় প্রান্ত থেকে উপাদান যোগ করতে এবং অপসারণ করতে দেয়।'''
list = ["x", "y", "z"]
deq = collections.deque(list)
print(deq)


# *Chainmap Objects
'''একটি চেইনম্যাপ ক্লাস একটি একক তালিকা তৈরি করতে একাধিক অভিধানকে একত্রিত করতে ব্যবহৃত হয়। লিঙ্ক করা অভিধান তালিকায় সঞ্চয় করে এবং এটি সর্বজনীন এবং মানচিত্র বৈশিষ্ট্য দ্বারা অ্যাক্সেস করা যেতে পারে। নিম্নলিখিত উদাহরণ বিবেচনা করুন.'''
baseline = {'Name': 'Peter', 'Age': '14'}
adjustments = {'Age': '14', 'Roll_no': '0012'}
print(collections.ChainMap(adjustments, baseline))
