# স্ক্যাটার প্লট ব্যাখ্যা করা হয়েছে
# x-অক্ষ বয়সের প্রতিনিধিত্ব করে, এবং y-অক্ষ গতির প্রতিনিধিত্ব করে।

# ডায়াগ্রাম থেকে আমরা যা পড়তে পারি তা হল দুটি দ্রুততম গাড়ি দুটির বয়স ছিল 2 বছর, এবং ধীরগতির গাড়িটির বয়স ছিল 12 বছর৷

# দ্রষ্টব্য: মনে হচ্ছে যে গাড়িটি যত নতুন, তত দ্রুত এটি চালাবে, তবে এটি একটি কাকতালীয় হতে পারে, সর্বোপরি আমরা মাত্র 13টি গাড়ি নিবন্ধিত করেছি।
import matplotlib.pyplot as plt

x = [5, 7, 8, 7, 2, 17, 2, 9, 4, 11, 12, 9, 6]
y = [99, 86, 87, 88, 111, 86, 103, 87, 94, 78, 77, 85, 86]

plt.scatter(x, y)
plt.show()
